#include <stdio.h>

int main(void) {
    int x, y, z;
    printf("구구단을 출력하는 프로그램 중 1에 해당하는 프로그램을 출력하시오.\n");
    printf("------------------------------------------------------------------------------\n");
    for(x = 0; x < 3; x++) {
        for(y = 1; y <= 9; y++) {
            for(z = 3; z > 0; z--) {
                printf("%d * %d = 2%d\t", i * 3 + k, j, (i * 3 + k)* j);
            }
            printf("\n");
        }
        printf("\n");
    }
    printf("--------------------------------------------------------------------------------");
}
